ConfigFiles/Enums/СтатусыСборокВерсииПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыСборокВерсииПроекта</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ознакомительная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тестовая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеДляВстраивания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляПредварительногоВстраивания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Финальная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ConfigFiles/Enums/СтатусыСборокВерсииПроекта/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Библиотека = Ложь;
	
	Если Параметры.Свойство("Библиотека") Тогда
		Библиотека = Параметры.Библиотека;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если Библиотека Тогда
		СписокВыбора = Новый СписокЗначений;
		СписокВыбора.Добавить(Перечисления.СтатусыСборокВерсииПроекта.НеДляВстраивания);
		СписокВыбора.Добавить(Перечисления.СтатусыСборокВерсииПроекта.ДляПредварительногоВстраивания);
		СписокВыбора.Добавить(Перечисления.СтатусыСборокВерсииПроекта.Финальная);
	Иначе
		СписокВыбора = Новый СписокЗначений;
		СписокВыбора.Добавить(Перечисления.СтатусыСборокВерсииПроекта.Ознакомительная);
		СписокВыбора.Добавить(Перечисления.СтатусыСборокВерсииПроекта.Тестовая);
		СписокВыбора.Добавить(Перечисления.СтатусыСборокВерсииПроекта.Финальная);
	КонецЕсли;
	
	ДанныеВыбора = СписокВыбора;
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
